[
{
    "model": "auth.user",
    "fields": {
        "password": "pbkdf2_sha256$120000$udz7H29cGU5r$uee4JAkHBrDxJTVGxrXRKdaCmzg8i0MY0G00jIEPMkM=",
        "last_login": "2018-10-04T03:22:38.104Z",
        "is_superuser": true,
        "username": "admin",
        "first_name": "",
        "last_name": "",
        "email": "admin@example.com",
        "is_staff": true,
        "is_active": true,
        "date_joined": "2018-09-12T23:08:52.783Z",
        "groups": [],
        "user_permissions": []
    }
},
{
    "model": "auth.user",
    "fields": {
        "password": "pbkdf2_sha256$120000$RI9f4NxP5whI$ofMQebtAK1BQyXsPhnMJfRf+UChteZ4rzqRvNc+EaV4=",
        "last_login": "2018-10-04T04:13:21.531Z",
        "is_superuser": false,
        "username": "abisoye",
        "first_name": "Abisoye",
        "last_name": "Adekoya",
        "email": "adekoyaatr@gmail.com",
        "is_staff": true,
        "is_active": true,
        "date_joined": "2018-10-03T00:31:33Z",
        "groups": [],
        "user_permissions": []
    }
},
{
    "model": "sessions.session",
    "pk": "2do155y3pwc7oaubds95lwtqyfzx2puu",
    "fields": {
        "session_data": "NTJiZjgyNTliMDBkMjAyNTMyYThhZDA1YThiY2E5NDc0NGYyZmRiZDp7Il9hdXRoX3VzZXJfaWQiOiIyIiwiX2F1dGhfdXNlcl9iYWNrZW5kIjoiZGphbmdvLmNvbnRyaWIuYXV0aC5iYWNrZW5kcy5Nb2RlbEJhY2tlbmQiLCJfYXV0aF91c2VyX2hhc2giOiJiNzRiZmQ2MmFkNWQwMTQzYTYzMzgwODNhODA1YzBkMDE2MmRkZDc4In0=",
        "expire_date": "2018-10-16T20:03:45.946Z"
    }
},
{
    "model": "sessions.session",
    "pk": "8eyiqm7oexv7o9j1phohrwe2hrkunpk1",
    "fields": {
        "session_data": "ZjlmZGIyMmFlNDJhMjA0ZTQ2MjE2NTZiZWVkNGQzNDI5NmQwNDA5Yzp7Il9hdXRoX3VzZXJfaWQiOiIzIiwiX2F1dGhfdXNlcl9iYWNrZW5kIjoiZGphbmdvLmNvbnRyaWIuYXV0aC5iYWNrZW5kcy5Nb2RlbEJhY2tlbmQiLCJfYXV0aF91c2VyX2hhc2giOiIxYjE3YjRhZTdhMTg0YzhlZGM3NTc1ZTM1YmFjNTIxYTk3ZWVlM2NlIn0=",
        "expire_date": "2018-10-18T03:53:43.821Z"
    }
},
{
    "model": "sessions.session",
    "pk": "d096z5l6hojw2odmfuj5rx1j65zvutgc",
    "fields": {
        "session_data": "ZjlmZGIyMmFlNDJhMjA0ZTQ2MjE2NTZiZWVkNGQzNDI5NmQwNDA5Yzp7Il9hdXRoX3VzZXJfaWQiOiIzIiwiX2F1dGhfdXNlcl9iYWNrZW5kIjoiZGphbmdvLmNvbnRyaWIuYXV0aC5iYWNrZW5kcy5Nb2RlbEJhY2tlbmQiLCJfYXV0aF91c2VyX2hhc2giOiIxYjE3YjRhZTdhMTg0YzhlZGM3NTc1ZTM1YmFjNTIxYTk3ZWVlM2NlIn0=",
        "expire_date": "2018-10-18T03:52:13.226Z"
    }
},
{
    "model": "sessions.session",
    "pk": "h9wepctu8nf98ly4dwjqn7s46hf1gqo0",
    "fields": {
        "session_data": "NTJiZjgyNTliMDBkMjAyNTMyYThhZDA1YThiY2E5NDc0NGYyZmRiZDp7Il9hdXRoX3VzZXJfaWQiOiIyIiwiX2F1dGhfdXNlcl9iYWNrZW5kIjoiZGphbmdvLmNvbnRyaWIuYXV0aC5iYWNrZW5kcy5Nb2RlbEJhY2tlbmQiLCJfYXV0aF91c2VyX2hhc2giOiJiNzRiZmQ2MmFkNWQwMTQzYTYzMzgwODNhODA1YzBkMDE2MmRkZDc4In0=",
        "expire_date": "2018-10-14T23:38:57.919Z"
    }
},
{
    "model": "sessions.session",
    "pk": "k92kjwak89uf4u00b939v0795hi1nebv",
    "fields": {
        "session_data": "ZjlmZGIyMmFlNDJhMjA0ZTQ2MjE2NTZiZWVkNGQzNDI5NmQwNDA5Yzp7Il9hdXRoX3VzZXJfaWQiOiIzIiwiX2F1dGhfdXNlcl9iYWNrZW5kIjoiZGphbmdvLmNvbnRyaWIuYXV0aC5iYWNrZW5kcy5Nb2RlbEJhY2tlbmQiLCJfYXV0aF91c2VyX2hhc2giOiIxYjE3YjRhZTdhMTg0YzhlZGM3NTc1ZTM1YmFjNTIxYTk3ZWVlM2NlIn0=",
        "expire_date": "2018-10-18T04:13:21.540Z"
    }
},
{
    "model": "sessions.session",
    "pk": "km40t3kgnelp682lyrkr5h8mw79mn0xj",
    "fields": {
        "session_data": "ZjlmZGIyMmFlNDJhMjA0ZTQ2MjE2NTZiZWVkNGQzNDI5NmQwNDA5Yzp7Il9hdXRoX3VzZXJfaWQiOiIzIiwiX2F1dGhfdXNlcl9iYWNrZW5kIjoiZGphbmdvLmNvbnRyaWIuYXV0aC5iYWNrZW5kcy5Nb2RlbEJhY2tlbmQiLCJfYXV0aF91c2VyX2hhc2giOiIxYjE3YjRhZTdhMTg0YzhlZGM3NTc1ZTM1YmFjNTIxYTk3ZWVlM2NlIn0=",
        "expire_date": "2018-10-17T15:05:50.373Z"
    }
},
{
    "model": "sessions.session",
    "pk": "oixw74uribxxh01wjnxbsf77c5na0j1z",
    "fields": {
        "session_data": "NTJiZjgyNTliMDBkMjAyNTMyYThhZDA1YThiY2E5NDc0NGYyZmRiZDp7Il9hdXRoX3VzZXJfaWQiOiIyIiwiX2F1dGhfdXNlcl9iYWNrZW5kIjoiZGphbmdvLmNvbnRyaWIuYXV0aC5iYWNrZW5kcy5Nb2RlbEJhY2tlbmQiLCJfYXV0aF91c2VyX2hhc2giOiJiNzRiZmQ2MmFkNWQwMTQzYTYzMzgwODNhODA1YzBkMDE2MmRkZDc4In0=",
        "expire_date": "2018-09-26T23:09:11.679Z"
    }
},
{
    "model": "blog.post",
    "pk": 1,
    "fields": {
        "author": [
            "abisoye"
        ],
        "title": "Justice Scalia Brought the Funny, Even to Tax Litigation",
        "text": "Even the late Justice Antonin Scalia’s harshest critics often admire his wit and biting sarcasm, albeit sometimes grudgingly. Justice Scalia seemed to display this temperament at every turn: while giving speeches, participating in interviews and even while commuting to the Supreme Court:\r\n\r\n“A snowstorm hit D.C. and [Chief Justice] Rehnquist had declared that the elements would not stop the proceedings of the court. He arranged for jeeps to be sent to the homes of the justices, but Scalia still had to walk half a mile through waist deep snow to reach the jeep. He shared a ride with [Justice] Anthony Kennedy and one of the attorneys to argue before the court that day. At one point the group became worried that they would be late to court, so Scalia leaned forward and told the driver ‘by the power vested in me, I command you to run these red lights!’” – “The Nine,” by Jeffrey Toobin\r\n\r\nYet at no time was this personality more on display to the public than when Justice Scalia wrote a dissenting or concurring opinion. It was while writing outside of the Court’s majority opinion that Justice Scalia seemed to feel the most freedom (a freedom he implied was unique to dissenting and concurring opinion writers when he stated in his Obergefell v. Hodges dissent that, “It is one thing for separate concurring or dissenting opinions to contain extravagances, even silly extravagances, of thought and expression; it is something else for the official opinion of the Court to do so.”)\r\n\r\nAnd it was while displaying this freedom that Justice Scalia managed even to bring color to opinions on issues affecting federal taxation. Some of these opinions concerned critical issues, such as whether the constitution guarantees a right to same-sex marriage or the validity of the Affordable Care Act. Others concerned more mundane tax issues, such as the deductibility of an estate’s administrative expenses. Below are some excerpts from these opinions (internal citations are omitted).\r\n\r\nObergefell v. Hodges , 135 S.Ct. 2584, 2015 BL 204916 (2015): “Ask the nearest hippie”\r\n\r\nDissenting from the majority’s holding that the Fourteenth Amendment requires a state to license same-sex marriages, and to recognize those marriages lawfully licensed and performed out-of-state, Justice Scalia pointed out what he believed were the “silly extravagances” of Justice Kennedy’s majority opinion. Providing a gloss on the opinion’s assertion that, “The nature of marriage is that, through its enduring bond, two persons together can find other freedoms, such as expression, intimacy, and spirituality,” Justice Scalia said, parenthetically:\r\n\r\n“Really? Who ever thought that intimacy and spirituality [whatever that means] were freedoms? And if intimacy is, one would think Freedom of Intimacy is abridged rather than expanded by marriage. Ask the nearest hippie. Expression, sure enough, is a freedom, but anyone in a long-lasting marriage will attest that that happy state constricts, rather than expands, what one can prudently say.”\r\n\r\nKing v. Burwell , 135 S. Ct. 2480, 2015 BL 202885 (2015): “Pure applesauce”\r\n\r\nJustice Scalia took particular exception to the Court’s recent holding that the phrase “an Exchange established by the State” in a key provision of the Affordable Care Act (codified at §36B of the Internal Revenue Code) refers not only to those insurance exchanges established by a state, but also to those established by the federal government. Summarizing what he believed to be the intellectual gymnastics that it took for the majority to reach its conclusion, Justice Scalia stated:\r\n\r\n“Roaming even farther afield from §36B, the Court turns to the Act's provisions about ‘qualified individuals.’ Qualified individuals receive favored treatment on Exchanges, although customers who are not qualified individuals may also shop there. The Court claims that the Act must equate federal and state establishment of Exchanges when it defines a qualified individual as someone who (among other things) lives in the ‘State that established the Exchange,’ Otherwise, the Court says, there would be no qualified individuals on federal Exchanges, contradicting (for example) the provision requiring every Exchange to take the ‘interests of qualified individuals’ into account when selecting health plans. Pure applesauce. Imagine that a university sends around a bulletin reminding every professor to take the ‘interests of graduate students’ into account when setting office hours, but that some professors teach only undergraduates. Would anybody reason that the bulletin implicitly presupposes that every professor has ‘graduate students,’ so that ‘graduate students’ must really mean ‘graduate or undergraduate students’? Surely not.”\r\n\r\nUnited States v. Windsor , 133 S.Ct. 2675, 2013 BL 169620 (2013): “this loaf could have used a while longer in the oven”\r\n\r\nJustice Scalia began his dissent from the Court’s opinion invalidating the federal Defense of Marriage Act by asserting that the Court did not even have the power to consider the case:\r\n\r\n“The Court is eager—hungry—to tell everyone its view of the legal question at the heart of this case. Standing in the way is an obstacle, a technicality of little interest to anyone but the people of We the People, who created it as a barrier against judges’ intrusion into their lives. They gave judges, in Article III, only the ‘judicial Power,’ a power to decide not abstract questions but real, concrete ‘Cases’ and ‘Controversies.’ Yet the plaintiff and the Government agree entirely on what should happen in this lawsuit. They agree that the court below got it right; and they agreed in the court below that the court below that one got it right as well. What, then, are we doing here?”\r\n\r\nJustice Scalia was similarly colorful later in the opinion when taking exception to the Court’s reasoning—or, as he contended, apparent lack thereof:\r\n\r\n“Some might conclude that this loaf could have used a while longer in the oven. But that would be wrong; it is already overcooked. The most expert care in preparation cannot redeem a bad recipe.’”\r\n\r\nNational Federation of Independent Business v. Sebelius , 132 S. Ct. 2566, 2012 BL 160004 (2012): “Commerce becomes everything”\r\n\r\nDissenting from the Court’s conclusion that the Affordable Care Act’s requirement that individuals purchase health insurance was a valid exercise of the federal government’s taxing power, Justice Scalia also provided “a few respectful responses to Justice Ginsberg’s dissent,” in which she argued that Congress could enact this requirement pursuant to its constitutional commerce power because the failure to buy health insurance was an economic activity. Justice Scalia stated:\r\n\r\n“If all inactivity affecting commerce is commerce, commerce is everything. Ultimately the dissent is driven to saying that there is really no difference between action and inaction, a proposition that has never recommended itself, neither to the law nor to common sense. To say, for example, that the inaction here consists of activity in ‘the self-insurance market,’ seems to us wordplay. By parity of reasoning the failure to buy a car can be called participation in the non-private-car-transportation market. Commerce becomes everything.”\r\n\r\nRaymond B. Yates, M.D., Profit Sharing Plan et al. v. Hendon, Trustee , 124 S. Ct. 1330 (2004): “a sledgehammer to kill a gnat”\r\n\r\nThough ultimately concurring with the Court’s conclusion that a working business owner’s pension rights in that business’s pension plan are protected by the Employee Retirement Income Security Act of 1974, Justice Scalia argued that the majority should have reached this conclusion by simply following an existing U.S. Department of Labor advisory opinion. Justice Scalia described the majority’s methods as follows:\r\n\r\n“The Court uses a sledgehammer to kill a gnat—though it may be a sledgehammer prescribed by United States v. Mead Corp., 533 U.S. 218 (2001). I dissented from that case, and remain of the view that authoritative interpretations of law by the implementing agency, if reasonable, are entitled to respect.”\r\n\r\nRomani, Francis J., Estate of, et al., U.S. v. United States Supreme Court , 118 S. Ct. 1478 (1998): “history of legislation-that-never-was”\r\n\r\nConcurring with the Court’s holding that the federal insolvency statute does not require that a federal tax claim be given preference over a judgment creditor's perfected lien on real property, Justice Scalia nonetheless took issue with the extent to which the majority relied on sources beyond the text of the federal statute at issue:\r\n\r\n“I have in the past been critical of the Court's using the so-called legislative history of an enactment (hearings, committee reports, and floor debates) to determine its meaning. Today, however, the Court's fascination with the files of Congress (we must consult them, because they are there) is carried to a new silly extreme. Today's opinion ever-so-carefully analyzes, not legislative history, but the history of legislation-that-never-was. If we take this sort of material seriously, we require conscientious counsel to investigate (at clients' expense) not only the hearings, committee reports, and floor debates pertaining to the history of the law at issue (which is bad enough), but to find, and then investigate the hearings, committee reports, and floor debates pertaining to, later bills on the same subject that were never enacted. This is beyond all reason, and we should say so.”\r\n\r\nHubert Est., et al., Commissioner v. United States Supreme Court , 117 S. Ct. 1124 (1997): “a tax boondoggle”\r\n\r\nDissenting from the Court’s holding in a dispute over the deductibility of administration expenses associated with marital or charitable bequests, Justice Scalia criticized the majority opinion not just for going beyond the applicable statute and IRS guidance, but for creating, in his view, an unwieldly deductibility test:\r\n\r\n“The statute and regulation most applicable to the question presented in this case are discussed in today's opinion almost as an afterthought. Instead of relying on the text of [§]2056(b)(4)(B) and its interpretive regulation . . . the plurality hinges its analysis on general principles of valuation which it mistakenly believes to inhere in the estate tax. It thereby creates a tax boondoggle never contemplated by Congress, and announces a test of deductibility virtually impossible for taxpayers and the IRS to apply.”\r\n\r\nO'Gilvie, Kevin M., et al. v. United States , 117 S. Ct. 452 (1996)\r\n\r\nThe Court in O’Gilvie concluded that punitive damages received in a personal injury lawsuit are taxable. It is hard to imagine a passage that captures Justice Scalia’s loathing for reasoning outside of the text of a statute than this one from his dissent:\r\n\r\n“So, to trace the Court's reasoning: The statute must exclude punitive damages because the Committee Report must have had in mind a 1918 Treasury Decision, whose text no more supports exclusion of punitive damages than does the text of the statute itself, but which must have MEANT to exclude punitive damages since it was based on the ‘return-of-capital’ theory, though, inconsistently with that theory, it did NOT exclude the much more common category of compensation for lost income. Congress supposedly knew all of this, and a reasonably diligent lawyer could figure it out by mistrusting the inclusive language of the statute, consulting the Committee Report, surmising that the Treasury Decision of 1918 underlay that Report, mistrusting the inclusive language of the Treasury Decision, and discerning that Treasury COULD have overlooked lost-income compensatories, but could NOT have overlooked punitives. I think not. The sure and proper guide, it seems to me, is the language of the statute, inclusive by nature and doubly inclusive by contrast with surrounding provisions.”",
        "created_date": "2018-09-12T23:17:39Z",
        "is_published": true,
        "published_date": "2016-02-18T12:00:00Z"
    }
},
{
    "model": "blog.post",
    "pk": 3,
    "fields": {
        "author": [
            "abisoye"
        ],
        "title": "Are There Tax Incentives for Individuals to Convert Their Employment Contracts to Partnership Agreements?",
        "text": "The 2017 tax act (Pub. L. 115-97) introduced new §199A, which provides deduction for individuals engaged in a qualified trade or business through a partnership, S corporation, an LLC or sole proprietorship. \r\n\r\nThe deduction equals to 20% of the individual’s qualified business income derived from qualified trade or business, which includes any business other than the trade or business of performing services as an employee or a specified service business involving health, law, accounting, athletics and financial services. The amount of the deduction cannot exceed the amount resulting either from 50% of the wages paid by the business or 25% of wages paid plus 2.5% of the business’s property used for deriving income. However, the limitation and the specified service business exclusion do not apply to individuals who make less than $157,500 (or $315,000 for a married couple).  \r\n\r\nThe new provision may provide an incentive to rearrange employer-employee relationship to one in which there is a partnership with the original partnership under a partnership agreement in which the individual’s income from the partnership can be eligible for the §199A deduction. However, there are reasons not to do so, because the deduction does not apply to certain §707 payments for services and excludes highly paid individuals providing the specified business services. Also, while favorable qualified business income treatment also might be obtained by converting the employment relationship to one in which the service-provider is an independent contractor, this potentially leaves the partnership open to an IRS employment tax audit.",
        "created_date": "2018-09-12T23:18:10Z",
        "is_published": true,
        "published_date": "2018-02-03T06:00:00Z"
    }
},
{
    "model": "blog.post",
    "pk": 6,
    "fields": {
        "author": [
            "abisoye"
        ],
        "title": "How to Price Your Freelance Business with Taxes in Mind",
        "text": "Hey, freelancer—stop me if this sounds familiar. You’ve just opened your website or started an account with a freelancer platform, and your first client has popped up with a job. You’re ecstatic and jump on the opportunity, but then they ask the big question: “What do you charge?”\r\n\r\nWell, what do you charge?\r\n\r\nMoney is an awkward subject to discuss for a lot of people, and when it comes to selling your own creations or services, it can get pretty uncomfortable if you’re not confident with the prices you’ve set.\r\n\r\nSo where do you start when it comes to pricing at a fair rate?\r\n\r\nHow much money do you want to make as a freelancer?\r\nHa! Funny question. I’d love to make millions of dollars writing tax blogs every week. Ha ha! Ha. Well, okay, probably not going to happen.\r\n\r\nOn a more realistic note, I do know my monthly bills, which helps me calculate how much I’d need to earn from freelance work to meet my goals. (Technically I’m not a freelancer, but you get what I’m saying.)\r\n\r\nIs your self-run business going to be your livelihood? Or is it just a way to make car payments without touching your 9-to-5 paycheck? Know what your goals are for freelancing, and turn that into a definite number.\r\n\r\nWhat do your freelance services cost you?\r\nWhen I say “cost,” I’m talking about time too.\r\n\r\nTo find out the true cost of what you’re doing, you’ll need to calculate:\r\n\r\nHow much time it takes to complete the job from start and finish\r\nHow much money you have to spend to make it happen\r\nWhen you do this, don’t just add up the time you spend shooting the photos or typing the blog post. Include the time and money it takes you to drive to location, pay the parking fee, set up the tripod, pack it all up, fill up on gas, and go home.\r\n\r\nEvery part of your creative process that must happen for the final product to work needs to be taken into account. Once you have a number for how much money and effort it takes, add that to the amount that you want to make.\r\n\r\nTaxes for freelancers illustration\r\n\r\nHow will income taxes and state taxes affect your freelancer paycheck?\r\nRelax—this isn’t going to be the part that makes you throw up your hands and give up. (Hopefully that won’t ever be a part, but you know.)\r\n\r\nMany freelancers don’t quite make it to this step before it’s too late. As a freelancer, you have to be your own boss when it comes to tracking how much tax you owe and making sure the IRS gets it each quarter.\r\n\r\nYou may have heard stories of first-year freelancers getting hit hard with a huge tax bill in the beginning of the year due to fees and penalties on top of the taxes they already owed, simply because they didn’t factor taxes into their pricing.\r\n\r\nTo figure out how much your taxes will be, you’ll need to:\r\n\r\nSubtract your business expenses from your income\r\nCalculate self-employment taxes on your profit\r\nNow that you know what your taxes are, you can adjust your price so that after taxes and expenses, you still get to take home your goal amount.\r\n\r\nNot sure how to do that? No problem. We have a handy tax estimator app to help you understand your tax situation, even if you’re a freelancer!\r\n\r\nStep four: Be confident in your final price\r\nOnce you finish calculating how much you should charge to cover taxes, expenses and your desired income, the number may surprise you—and fears may start sprouting up like CGI weeds in a lawn-care commercial:\r\n\r\n“Who would pay this much for my service?”\r\n\r\n“Is what I’m doing actually worth the money?”\r\n\r\n“How can I convince anyone to hand over that amount of cash?”\r\n\r\nListen, you may have to make some minor adjustments, but don’t back down; your clients will ultimately value your work if you do. You know your needs, your goals, and how much you need to make for the gig to be worth it. Be confident and willing to stand up for yourself, and you’ll win clients.",
        "created_date": "2018-09-13T20:31:45.665Z",
        "is_published": false,
        "published_date": "2018-07-15T20:31:45Z"
    }
},
{
    "model": "blog.post",
    "pk": 8,
    "fields": {
        "author": [
            "abisoye"
        ],
        "title": "Charitable Donation Won't Erase Tax on Oscar Swag for Most Celebrities",
        "text": "Whether winners or losers at one of Hollywood’s star-studded award shows, most celebrity nominees can expect to walk away from events loaded down with expensive swag.\r\n\r\nExtravagant goody bags have become a staple at the Oscars, the Grammys, the Golden Globes and the Emmys. The “Everyone Wins” bags provided by Los Angeles marketing firm Distinctive Assets for this year’s Oscar nominees were each worth a whopping $100,000 (last year’s were worth even more, $232,000). Delivered to contenders in the event’s top categories, the bags included everything from pricey “smart” electronics to a getaway to a five-star hotel in the coastal town of Sorrento, Italy.\r\n\r\nBut as many know by now, these goodies aren’t really “free.” The Internal Revenue Service treats them as taxable income to the performers, who will receive a Form 1099-MISC, Miscellaneous Income, and must include that information on their federal tax returns. Single filers earning an annual income of more than $418,401 will owe 39.6 percent—or $39,600—in taxes on the 2017 swag bag.\r\n\r\nHigh-net-worth celebrities who think they can avoid paying the tax man by donating the goody bag’s contents to charity might be sorely disappointed when they realize how little they can actually deduct.\r\n\r\n“They can make a charitable contribution, but the problem is charitable contributions are going to be limited to 50 percent of their adjusted gross income, and you have a phase-out for itemized deductions when your adjusted gross income exceeds certain values,” said Narelle MacKenzie, an accounting lecturer at San Diego State University’s Fowler College of Business Administration.\r\n\r\nThe 50 percent rule is typically less of a limiting factor because most people won’t donate half of their income to charity, said Mark A. Luscombe, principal analyst for Wolters Kluwer Tax & Accounting. However, the phase-out can significantly reduce the charitable deduction, especially for extremely high earners, he said.\r\n\r\nThe phase-out limitation cuts the amount of deductions a person can take by 3 percent of AGI above $261,500—the threshold for a single filer in 2017—but the taxpayer can’t lose more than 80 percent of the total deduction.\r\n\r\nFor example, assume there are no other allowable itemized deductions and a celebrity who’s a single tax filer with an AGI of $3 million donates the entire $100,000 swag bag to charity. That $100,000 is an eligible itemized deduction. With a $3 million AGI, the donor is $2.74 million over the $261,500 threshold. Three percent of $2.74 million is $82,155. Since that number is more than 80 percent of $100,000, the loss would be capped at $80,000, and the celebrity ends up with a $20,000 deduction on the donation.\r\n\r\nBut all is not lost. Celebrities can avoid the goody bag tax altogether by simply not accepting the gift, MacKenzie said.\r\n\r\nAdditionally, a spokeswoman for Distinctive Assets—which is also the preferred provider for the coveted Grammy gift bag worth $30,000 this year—pointed out that more than 90 percent of their bags’ contents fall under the category of gift certificates or “gift offers.” “In the case of gift certificates and other ‘gift offers,’ there is no value to the celebrity unless they actually redeem a gift certificate,” the spokeswoman said.\r\n\r\nLuscombe pointed to guidance on the tax treatment of gift bags posted to the IRS website in the form of questions and answers (https://www.irs.gov/uac/gift-bag-questions-and-answers). The guidance clarifies that a person has to both “accept” and “redeem” non-transferable certificates or vouchers for these to be considered taxable income.",
        "created_date": "2018-09-13T20:37:41.533Z",
        "is_published": true,
        "published_date": "2017-03-01T21:37:41Z"
    }
},
{
    "model": "blog.post",
    "pk": 10,
    "fields": {
        "author": [
            "abisoye"
        ],
        "title": "IRS Takes Further Steps to Combat Tax-Related Identity Theft",
        "text": "I have blogged before on tax-related identity theft (Identity Theft Pervasive, Overwhelms IRS and When Your Return Preparer Betrays You) and the efforts the IRS is making to curb the still-growing epidemic.  The IRS has stated that, during 2015, it expanded its efforts to better protect taxpayers and help victims and that its employees continue to work hard to prevent refund fraud, investigate identity theft-related crimes and help taxpayers who have been victimized by identity thieves.  The following are some specific measures taken by the IRS.\r\n\r\nIn addressing refund fraud, the IRS will continue to increase the number of efficiency of identity theft data models and filters used to identify suspicious and potentially fraudulent returns.  In addition, the IRS has limited the number of direct deposit refunds to a single financial account or pre-paid debit card to three refunds.  After the third deposit, any subsequent refunds will be mailed in paper check form to the taxpayer.  This would also work to prevent dishonest tax return preparers from improperly depositing client refunds into their own accounts.\r\n\r\nRegarding the victims of tax-related identity theft, the IRS has instituted measures to minimize the incidence of identity theft and help the victims that can face a long and complex process for addressing the effects.  The cases are extremely complex and sometimes involve multiple years and multiple tax issues.  A typical case can take 120 days to resolve and the IRS is working hard to streamline process and reduce taxpayer frustration.  \r\n\r\nFor those that have already been victimized, the IRS has introduced The IRS Identity Protection PIN (IP PIN), a unique six digit number that is assigned annually to victims of identity theft for use when filing their federal tax return that shows that a particular taxpayer is the legitimate filer of the return. This features an online process through the IRS website to allow taxpayers that lose their IP PIN to create an account and receive an IP PIN online.\r\n\r\nTaxpayers that may be unaware that they are identity theft victims but have been identified by the IRS as potential victims because their accounts have indications of identity theft will be able to opt in to the IP PIN program.  In addition, the IRS continues to operate its IP PIN pilot program that allows taxpayers that filed tax returns last year from Florida, Georgia or the District of Columbia to opt into the IP PIN program.\r\n\r\nThe IRS Criminal Investigation (CI) division detects and investigates tax fraud and other financial fraud and often detects identity theft through its Questionable Refund Program (QRP) in which it detects false returns which may have used stolen identities to claim fraudulent tax refunds. CI has four Scheme Development Centers (SDCs) across the country whose primary mission is detecting refund fraud. CI is also the lead agency or is actively involved in more than 78 multi-regional task forces or working groups including state/local and federal law enforcement agencies solely focusing on identity theft.       \r\n\r\nThe IRS reminds taxpayers to make efforts to preventing becoming victims of identity theft by safeguarding personal computers and other devices, being aware of telephone scams and internet phishing scams, and protecting personal information in paper files and other documents.",
        "created_date": "2018-09-13T20:49:05.565Z",
        "is_published": true,
        "published_date": "2016-01-15T21:49:05Z"
    }
},
{
    "model": "blog.post",
    "pk": 12,
    "fields": {
        "author": [
            "abisoye"
        ],
        "title": "Neil Gorsuch Has Already Left His Mark on the IRS",
        "text": "The IRS’s journey back to Cheyenne, Wyo., to defend its denial of a penalty refund left it wincing from more than the blowing snow.\r\n\r\nThe government’s Washington-based attorneys likely hadn’t planned a return trip after Judge Nancy Freudenthal, on a pleasant Wyoming summer day in 2015, dismissed Corbin McNeill’s $4.59 million penalty refund claim, finding that McNeill couldn’t bring an individual action to challenge the penalty. Freudenthal went with the IRS’s argument that McNeill’s role as tax matters partner in a tax shelter partnership barred him from pursuing a partner-level defense.\r\n\r\nMcNeill, a former nuclear submarine commander and former chairman of Exelon Corp., who had retired to Jackson, Wyo., wasn’t one to give up without a fight. He took the battle down Interstate 25 to the federal appeals court in Denver. His case landed with a panel that included U.S. Supreme Court nominee Neil Gorsuch, who, fortunately for McNeill, believes in following the letter of the law.\r\n\r\nThat law, the Tax Equity and Fiscal Responsibility Act (TEFRA), didn't contain any language that would prevent the “managing (or tax matters) partner from pursuing a reasonable cause/good faith defense in later partner level proceedings,” Gorsuch said, contrary to the IRS’s interpretation.\r\n\r\nAfter being overturned once by a possible future Supreme Court justice, Freudenthal composed a very thorough findings of fact and conclusions of law, issued Feb. 24, ruling this time in favor of McNeill. He had reasonable cause to claim on his tax return a $20 million paper loss from a distressed asset/debt (DAD) tax shelter, she ruled, and did so in good-faith reliance on Ernst & Young, which prepared his tax return, and the law firm that provided him with an opinion letter blessing the tax aspects of the transaction.\r\n\r\nAppeals courts give deference to a trial court’s findings of fact, so the IRS will face an uphill battle if it decides to appeal the case. The agency can thank Gorsuch for opening the door to McNeill to present those facts.\r\n\r\nFreudenthal’s findings and conclusions didn’t provide any citable case law for attorneys representing taxpayers like McNeill who were led into tax shelters by questionable promoters, but as Tom Cullinan of Eversheds Sutherland (US) LLP told Bloomberg BNA, they did provide “a road map of how the government litigates a penalty case.”\r\n\r\nTEFRA will be replaced in 2018 with a new partnership tax regime that will allow the IRS to collect taxes at the partnership level. The new regime will do away with the two-level approach under TEFRA in which the IRS conducts audits at the partnership level but collects taxes at the partner level. Although TEFRA will technically be laid to rest at the end of the year, it is expected to enjoy a long afterlife in the courts as only departed tax provisions can, making Gorsuch’s decision relevant for some time to come.",
        "created_date": "2018-09-13T20:54:56.816Z",
        "is_published": true,
        "published_date": "2017-04-06T14:30:56Z"
    }
},
{
    "model": "blog.post",
    "pk": 13,
    "fields": {
        "author": [
            "abisoye"
        ],
        "title": "Deductibility of Surrogacy Expenses by Same-Sex Couples: Florida District Court Weighs In",
        "text": "In a prior blog, I talked about some of the major issues present in a District of Florida case filed in November 2015 in which Joseph F. Morrissey, a professor at Stetson Law School, initiated action against the United States over the IRS’s denial of tax deductions for assisted reproductive technology (ART) expenses claimed on his 2011 tax return.  You can access my prior blogs at https://www.bna.com/samesex-marriage-equality-b57982066963/ (discussing the Morrissey case) and http://www.bna.com/doma-overturned-enough-b17179872740/ (discussing pre-Windsor arguments). \r\n\r\nOn December 22, 2016, the issues in the Morrissey case were finally decided.  See Morrissey v. United States, No. 8:15-cv-2736-T-26AEP, 2016 BL 447323 (M.D. Fla. Dec. 22, 2016).  Unfortunately for the taxpayer, and many same-sex male couples in Florida seeking to deduct similar expenses, the District Court ruled in favor of the IRS and granted its motion for summary judgment against Morrissey. \r\n\r\nUnder the facts of the case, Mr. Morrissey, a gay male, alleged that the IRS improperly denied him a deduction for medical expenses he incurred in paying fertility specialists to help conceive a child through use of in vitro fertilization (requiring the use of an egg donor and female surrogate).  Plaintiff alleges that heterosexual couples have routinely been allowed to deduct these types of medical family planning expenses, even where the expenses are for elective procedures that are not medically necessary.  Plaintiff also alleges that the IRS’s assertion that plaintiff’s homosexuality was a choice and that he could conceive a child through a sexual relationship with a woman, thus rendering the expenses unnecessary, was without merit as he was in a committed monogamous relationship with his partner and recently had become engaged to him.  In addition, he alleges that any so-called “choice” to raise a family with his same-sex partner is protected from discrimination by the Constitution under Obergefell and that, in any event, the Supreme Court has recognized in Obergefell that homosexuality is an immutable sexual orientation, and not a choice.  In addition, he alleges that he is effectively infertile and that this fact, along with the holding in Obergefell, requires I.R.C. §213 to be construed in such a way as to authorize his deductions for surrogacy expenses.  (Note, it is interesting that the District of Florida court mentioned in its decision that Mr. Morrissey’s partner was his “chosen” life partner, a reference that raises the hint of animus, such as used by the original IRS individual denying the deduction, whereby individuals with issues against same-sex couples imply that sexual orientation is a choice and not an immutable characteristic.  For purposes of this blog, I assume the “chosen” designation was not intentionally derogatory against Mr. Morrissey). \r\n\r\nIn relevant part, I.R.C. Section 213(a) allows taxpayers a deduction for “the expenses paid during the taxable year, not compensated for by insurance or otherwise, for medical care of the taxpayer, his spouse, or a dependent ….” I.R.C. Section 213(d)(1) further defines medical care as amounts paid “for the diagnosis, cure, mitigation, treatment, or prevention of disease, or for the purpose of affecting any structure or function of the body” (emphasis added).\r\n\r\nThe District of Florida court first concluded that Morrissey’s “effective infertility” argument was without merit because the surrogacy expenses only affected the function or structure of the bodies of third parties, and not the body of the taxpayer.  An argument that plaintiff’s own lack of “reproductive function” was enough to meet the function or structure test was insufficient.    The court further concluded that no constitutional violations existed because, in denying plaintiff’s deduction, the IRS applied the statute consistently with its approach in other cases.  Specifically, in Longino, T.C. Memo 2013-80 (2013), a heterosexual male was denied the deduction (note, with respect to his fiancée who was not his legal spouse) and the IRS had published guidance in IRS INFO 2002-0291 stating that it would deny the deduction associated with third-party gestational surrogacy without regard to marital status, sexual orientation or even condition of infertility (note, who knew that IRS Info Letters held the rule of law?).   \r\n\r\nKey Takeaways:  The District of Florida case certainly doesn’t decide the issue for all same-sex male taxpayers seeking to deduct surrogacy or ART expenses.  In the absence of precedent, other district courts, and especially other circuit courts (other than (1) the 1st circuit and the district courts under it as Magdalin was affirmed by the 1st circuit, and (2) the 11th Circuit which affirmed the Longino case.  Note that the 1st circuit has appellate jurisdiction over district courts in Maine, Massachusetts, New Hampshire, Rhode Island and Puerto Rico and the 11th circuit has jurisdiction over district courts in Alabama, Florida and Georgia), can certainly decide the issue another way.  It is troubling that there was no discussion of an argument that surrogacy costs are actually costs incurred in the medical care of a taxpayer’s dependent, namely, the child conceived through surrogacy.  If the father cannot deduct the surrogacy expenses because they are not expenses for medical care of himself, then why can’t they be deducted as expenses for the medical care of his child?   The medical care certainly relates to a function of the child’s body.  Without the surrogacy, the child would not exist.   No fundamental right or equal protection argument is necessary here.  It is incontrovertible that the child is the dependent of the taxpayer, especially coupled with a scenario where the surrogate expressly gives up all parental rights to the child, a fundamental characteristic of almost all surrogacy relationships. \r\n\r\nEven turning back to the arguments made by the plaintiff in Morrissey, the Florida District Court decision seems to gloss over some of the more salient arguments made by the plaintiff about recent decisions in Obergefell and Windsor.  The Florida District Court appeared to bolster its conclusions on the fact that there was no equal protection violation while ignoring the fundamental right argument.  It is one thing for the language of a statute to be strictly read in accordance with its terms and something entirely different when the statute’s express terms violate fundamental rights (or even evolving equal protection analysis, assuming a more sophisticated argument is made than the one in Morrissey).  Distinguishing actual fertility from effective fertility or dysfertility is incongruous with the reality of same-sex male couples who are physically incapable of having children and who turn to surrogacy, but who are treated differently and unequally from heterosexual couples who get to take deductions for the exact same situation.",
        "created_date": "2018-09-13T21:05:30.542Z",
        "is_published": true,
        "published_date": "2017-03-06T22:05:30Z"
    }
},
{
    "model": "blog.post",
    "pk": 15,
    "fields": {
        "author": [
            "abisoye"
        ],
        "title": "Tax Checkup—What You Need to Know in September",
        "text": "It may seem odd, but September can actually be a pretty big month for taxes. Even if the upcoming deadlines don’t apply to you, everyone can benefit from giving their tax situation a checkup during the autumn months.\r\n\r\nSo what should you look out for when it comes to your taxes?\r\n\r\nExtensions\r\nThe IRS offers a six-month extension to file if you can’t make the April 15 tax deadline. An extension will give you extra time to get your return to the IRS, but it won’t extend the amount of time to pay any tax due. Payments have to be sent to the IRS by April 15; after that, you could owe interest and penalties.\r\n\r\nOctober 15 is the deadline to file your 2017 tax return if you filed an extension. Sure, that's still a little way away, but you’ll be glad when you don't have to deal with the stress of last-minute filing.\r\n\r\nCoffee helps fuel tax research in the fall.\r\n\r\nEstimated taxes\r\nWhen you're self-employed, no employer means no withholding. That’s where estimated tax payments come in. Think of estimated taxes as self-withholding.\r\n\r\nThe IRS says if you expect to owe federal taxes (including your self-employment tax) of $1,000 or more, you have to make estimated tax payments.\r\n\r\nThere are four estimated tax deadlines throughout the year: one in April, June, September, and January. The September 17 deadline is coming up, so if you need to make an estimated payment, now’s the time! Form 1040-ES has all the details, including calculation instructions and payment vouchers.\r\n\r\nTax reform\r\nYou may have heard that major tax reform only happens once every 30 years or so; it’s been 32 years since the last big tax change, so it’s high time to start figuring out how the Tax Cuts and Jobs Act will affect you.\r\n\r\nMany people will have lower tax rates (due to tax bracket changes) and bigger tax breaks (from the higher standard deduction and Child Tax Credit), so it’s a good idea to review how the changes will alter your personal finances. Do you need to withhold less? Would you rather have a big refund next year, or more money in your pocket per paycheck?\r\n\r\nWhether you need to file your 2017 return, determine your estimated tax payments, or do some reading up on tax reform, 1040.com is the place to be. Check out our Tax Guide for information; be sure to use our tax estimator online, in the App Store, or through Google Play; and check out our page on tax reform!",
        "created_date": "2018-09-13T21:17:54.776Z",
        "is_published": false,
        "published_date": "2018-09-07T14:15:25Z"
    }
},
{
    "model": "blog.post",
    "pk": 16,
    "fields": {
        "author": [
            "abisoye"
        ],
        "title": "EPIC Fail: IRS Can’t Disclose the President’s Tax Returns",
        "text": "EPIC is only one of many organizations hoping to catch a glimpse of President Trump’s tax returns.  But no matter the public interest, even the President’s return information is protected.  \r\n\r\nThe Electronic Privacy Information Center (EPIC) is a non-profit organization dedicated to the oversight of government activities.  Citing \"Congressional investigation and widespread public interest,” the “longstanding tradition of U.S. Presidents\" releasing their return information, and Trump’s widely speculated “financial dealings” with Russia, EPIC filed a FOIA request calling for the IRS to disclose Trump’s return information as far back as 2010.  But Treasury regulations require a requesting party to attach the taxpayer’s consent to their FOIA request in these matters (not surprisingly something EPIC was unable to obtain), so the IRS closed the request.  \r\n\r\nUndeterred, EPIC appealed the IRS’s response, and submitted a second request again asking for Trump’s return information.  This time EPIC argued that it was entitled to the information in order to correct several \"misstatements of fact\" it asserts the President made to the public.   The alleged misstatements:  Trump’s tweets insisting that he has \"ZERO investments in Russia,\" and stating \"Russia never tried to use leverage over me.  I HAVE NOTHING TO DO WITH RUSSIA – NO DEALS, NO LOANS, NO NOTHING!\"  EPIC believes these statements to be untrue, and pointed to I.R.C. §6103(k)(3) which allows disclosure of taxpayer return information to correct public misstatements of facts as long as Congress’s Joint Committee on Taxation gives permission.  Of course, the Joint Committee has given no such permission -- making it fairly clear why the IRS didn’t consider the appeal and closed EPIC’s second FOIA request.  The IRS also warned EPIC that it wouldn’t process any additional requests regarding the matter.  \r\n\r\nEPIC didn’t file any more requests, but it did file suit against the IRS asking the U.S. District Court for the District of Columbia to compel the IRS to release Trump’s return information.  It acknowledged that the Joint Committee never granted the necessary permission, but argued that the IRS should have asked for it.  \r\n\r\nHitting on what seems obvious, the court agreed with the IRS that without Trump’s consent to release his return information, EPIC’s FOIA request was incomplete and thus, properly closed.  The court also rejected EPIC’s §6103(k)(3) argument stating that \"[t]he plain terms of that section, which require congressional approval, foreclose any relief from the exhaustion barrier.\"  And the Joint Committee has never exercised its right to grant approval before.  The court additionally could not find support for EPIC’s claim that the IRS was required to seek Committee approval “so as to open wider its FOIA doors or to produce records that require such independent approval.”  \r\n\r\nEPIC’s case was promptly dismissed.     \r\n\r\nThere are other similar lawsuits out there – doubtful those parties will have better luck.",
        "created_date": "2018-10-03T00:47:51.465Z",
        "is_published": true,
        "published_date": "2017-08-26T00:47:51Z"
    }
},
{
    "model": "blog.post",
    "pk": 17,
    "fields": {
        "author": [
            "abisoye"
        ],
        "title": "Corrections and Substantive Fixes Needed with Respect to Employee Benefit Changes Made by the 2017 Tax Act",
        "text": "On December 22, President Trump signed into law Pub. L. No. 115-97 (the 2017 Act), the first major overhaul of the U.S. tax system in 30 years.  Although most of the discussion about the 2017 Act floating around is about changes in the taxation of business entities (such as the reduction in the corporate tax rate to a flat 21%, and the creation of a deduction for pass-through businesses), there were several important changes that affected executive compensation and employee benefits.  \r\n\r\nPerhaps the most notable change is the repeal of the commission and performance-based compensation exceptions to the $1 million yearly limit on the deduction for compensation paid with respect to a covered employee of a publicly traded corporation.  This change is applicable to tax years beginning after December 31, 2017, except that a transition rule applies to any written binding contract in effect on November 2, 2017, that is not modified in any material respect on or after that date.\r\n\r\nIn addition, the 2017 Act provides tax benefits to employees of certain start-up companies. Generally, under newly created §83(i), an employee may make a special election with respect to qualified stock transferred to by the employer, so that no amount is included in the employer’s income for the first tax year in which the rights of the employee in the stock are transferable or are not subject to a substantial risk of forfeiture, whichever is applicable. Income taxation can be deferred by the employee until the earlier of (a) five years, or (b) the occurrence of a specified event, such as the stock of the company being readily tradable on an established securities market, or a revocation of the election.\r\n\r\nWhile most employee benefits practitioners seem to be focused on the §162(m) and §83(i) changes, there are several additional changes made by the 2017 Act that directly affect the administration of qualified plans and benefits, including some changes and inconsistencies that may not have been intended by Congress.  For example, the 2017 Act limits the personal casualty loss itemized deduction for property losses (not used in connection with a trade or business or transaction entered into for profit) to apply only to losses incurred as a result of federally-declared disasters.  This limitation on deductibility applies to losses arising in tax years beginning after December 31, 2017, and before January 1, 2026.  While it may seem that a personal casualty loss deduction has no bearing on the administration of employee benefit plans, that is not the case where a §401(k) plan utilizes safe harbor language for hardship distributions.  Under Reg. §1.401(k)-1(d)(3)(iii)(B)(6), expenses for the repair of damage to an employee’s principal residence that qualify for the casualty deduction under §165 are deemed to be an immediate and heavy financial need for hardship distribution purposes. Therefore, to the extent a plan incorporates the safe harbor language in Reg. §1.401(k)-1(d)(3)(iii)(B)(6), a hardship distribution on account of a casualty would have to be limited to situations where the employee incurred a loss as a result of a federally-declared disaster, pursuant to changes made by the 2017 Act (i.e., adding §165(h)(5) to the I.R.C.).  If a hardship distribution was made on account of any other casualty, the plan could technically lose its qualified status for failing to be administered in accordance with its written terms and for violating language in the §401(k) regulations. \r\n\r\nAnother possible error in drafting involves distributions from retirement plans that are used to pay for expenses for qualified higher education.  The 2017 Act amended §529(e)(3) and added §529(c), with respect to qualified tuition programs.  The amendments provide that any reference to the term “qualified higher education expense” now includes a reference to up to $10,000 in expenses for tuition in connection with enrollment or attendance at an elementary or secondary public, private, or religious school.  Under §72(t), a 10% excise tax is imposed on certain “early” distributions from qualified retirement plans.  However, §72(t)(2)(E) provides for an exception where a distribution is made for “qualified higher education expenses.”  Section 72(t)(2)(E) references §72(t)(7), which, in turn, references §529(e)(3), which includes the change described above allowing up to $10,000 in elementary and middle school public, private, and religious expenses. However, the change by the 2017 Act only changed the definition of expenses under §529(e)(3) and §529(c)(7), and did not change the requirement that the expenses be incurred at an eligible educational institution (as defined in section §529(e)(5), as required by §72(t)(7)(A) (end flush language)). Because §529(e)(5) was not amended and the flush language of §72(t)(7)(A) still refers to higher educational institutions, the §72(t) 10% excise tax would still apply to distributions from qualified retirement plans that are used for elementary and middle school expenses, even though up to $10,000 of such expenses are permitted under §529 alone.  \r\n\r\nLastly, generally applicable to taxable years beginning after December 31, 2017, newly-created §4960 imposes an excise tax equal to the corporate tax rate (21%) on applicable tax-exempt organizations on remuneration in excess of $1 million that is paid to an applicable tax-exempt organization's five highest-paid employees for a tax year (or any person who was such an employee in any tax year beginning after 2016).  Remuneration is treated as paid when there is no substantial risk of forfeiture within the meaning of §457(f)(3)(B) of the rights to such remuneration.  An applicable tax-exempt organization is defined to include any organization which, for the taxable year, is exempt from taxation under §501(a), is a farmer's cooperative organization described in §512(b)(1), has income excluded from taxation under §115(1), or is a political organization under §527(e)(1).  \r\n\r\nUnfortunately, there is some confusion with the definition of an applicable tax-exempt organization. As the rules are currently written, it is unclear whether public universities  are included in the definition, and therefore subject to the excise tax on excess executive compensation under §4960. Although the definition of an applicable tax-exempt organization refers to organizations that have income excluded from taxation under §115(1), not all state schools (including, for importance under §4960, those with large athletic departments and highly-paid coaches) are considered to be tax-exempt entities due to §115(1), but instead, are tax-exempt under a doctrine of implied immunity that is respected by the federal government.  \r\n\r\nObviously, much guidance is still needed with respect to the 2017 Act.  Hopefully, Congress or, at the very least, the IRS will address the inconsistencies in the law described above and provide employers and plan administrators with clear guidance.",
        "created_date": "2018-10-03T17:28:00.959Z",
        "is_published": true,
        "published_date": "2017-10-03T17:30:00Z"
    }
},
{
    "model": "blog.post",
    "pk": 18,
    "fields": {
        "author": [
            "abisoye"
        ],
        "title": "Are You Using ‘Fake News’ for Your Tax Research?",
        "text": "The amount of free information on the Internet seems to grow each day. This makes it an essential resource for finding quick answers on topics ranging from vacation destinations to the merits of different tooth whitening formulas. But the axiom that “you get what you pay for” still applies to the quality of information on the Web. It would be a mistake to completely rely on the Internet for important medical advice.\r\n\r\nQuality of information is also an important element for tax research, George Farrah, editorial director of Bloomberg BNA Tax & Accounting recently noted in the Tax Executive.   \r\n\r\nThere is an abundance of tax information on the Web. Google provides search results for most tax terms, taxing authorities offer direct online access to laws, and law and accounting firm websites feature detailed articles written by professionals. But do these free online resources offer the best results? Relying too heavily on this type of information could lead to mistakes that might negatively impact a taxpayer’s bottom line. Farrah notes, among other things, that: \r\n\r\nOnline searches are not always reliable,\r\n\r\nTax law is not always black and white, and\r\n\r\nFree tax research is more time-consuming than it seems.\r\n\r\nFor example, an executive at a manufacturing company planning for the potential impact of tax reform would likely yield multiple hits from an online search for “tax reform.” But most of the results would probably be articles discussing the pros and cons of tax reform with little insight on concrete actions her company might take.\r\n\r\n It’s important to analyze the quality of the tax information you find, Farrah says, by asking these questions: \r\n\r\nDoes the research include references, and is it supported by regulations, statutes, administrative determinations, and case law?\r\nAre the authors experts in their fields?\r\nDo the authors offer unbiased opinions, or do they advocate particular positions?\r\nDoes the research offer an alternative opinion or outline the risks of a position?\r\nHas the research gone through a formal editing process that includes legal review?\r\nDo the authors offer or refer to additional articles on the topic?\r\nIs the research timely and current? Is it maintained and updated?\r\nDoes the research meet key criteria for quality such as accuracy, usefulness, understandability, and expected market impact?\r\nIs the research actionable (e.g., is it integrated with other research tools that help you meet your deliverable such as a research memo, a client letter, or a detailed plan)?\r\nDoes the research offer ways to digest the information?\r\nDoes the research offer guidance on how to get additional information on the topic?\r\nGauging the quality of your sources is essential to protecting against making poor conclusions that could negatively impact your company’s bottom line, Farrah said. “It is imperative that tax professionals put safeguards in place to ensure that their tax research is of the highest quality.”  \r\n\r\nGet a free trial to Bloomberg BNA Tax & Accounting's Federal Tax solution, a comprehensive research service that provides deep analysis and time-saving practice tools to help practitioners make well-informed decisions.",
        "created_date": "2018-10-03T18:00:22.920Z",
        "is_published": true,
        "published_date": "2018-10-03T18:07:40.278Z"
    }
},
{
    "model": "blog.post",
    "pk": 19,
    "fields": {
        "author": [
            "abisoye"
        ],
        "title": "How Tax Reform Will Affect Baby Boomers",
        "text": "The Tax Cuts and Jobs Act (TCJA) has been all the talk this year in financial circles, but how does it affect different taxpayers in different situations?\r\n\r\nWe’ve talked about how tax reform affects millennials and covered the basics of the new laws in our Tax Guide; now it’s time to look at another specific group. Today, that group is you, baby boomers!\r\n\r\nNow, to the main attraction. What parts of the TCJA will affect boomers most?\r\n\r\nThe (almost doubled) standard deduction\r\nThe new standard deduction is almost double for each filing status—the end result is that a lot of taxpayers who itemized deductions on Schedule A in the past won’t have to this year.\r\n\r\nItemizing can still be more advantageous in certain situations, but it’s important to remember that Congress repealed some itemized deductions, like the deduction for unreimbursed employee expenses and tax preparation fees. While the $4,050 personal exemption is gone, the increased standard deduction makes up the difference for most boomers.\r\n\r\nAdjusted tax bracket rates\r\nIn general, most brackets are now taxed at a lower percentage, and those tax brackets cover larger income ranges—meaning you can make more money before moving up a bracket.\r\n\r\nIf you work for someone else, you probably noticed that your employer applied the new IRS withholding tables earlier this year, so you’ve had less tax withheld each paycheck (more money in your pockets!).\r\n\r\nTax Reform Estimator\r\nWe’ve covered a basic overview of how tax reform affects boomers with different tax situations, but what about you?",
        "created_date": "2018-10-03T18:34:21.285Z",
        "is_published": false,
        "published_date": "2018-10-03T18:34:21Z"
    }
},
{
    "model": "blog.post",
    "pk": 20,
    "fields": {
        "author": [
            "abisoye"
        ],
        "title": "Kentucky: Thoroughbreds, Bourbon, and Taxpayer-Friendly Courts",
        "text": "The IRS hasn’t been faring well in the Bluegrass State. In the past six months it has lost three cases in the state involving tax shelters or what the agency suspects to be tax shelters. Two of those losses were to the same dermatologists.  \r\n\r\nThe loss that may have really left the government smarting wasn’t to the doctors, though: It was to the Ervin family—three brothers who worked on the family farm and in coal mines while in school and went to college on wrestling scholarships.   \r\n\r\nGary, Timothy, and Robert Ervin spent 20 years climbing poles and hanging telecommunications cable to build a successful business. They sold their business for a large sum in 1999 at the height of the telecom boom—a time when certain accounting and law firms were eager to help people like the Ervins invest their windfall with substantial tax savings.  \r\n\r\nThese investment products--tax shelters--involved imaginative interpretations of the federal partnership tax provisions and were marketed with catchy acronyms—like Son-of-BOSS, which is what BDO Seidman, the predecessor of BDO USA LLP, sold the Ervins.  \r\n\r\nThe Ervin brothers may know a lot about hanging cable and the fastest way to take an opponent to the mat, but, like most normal humans, they don’t know a lot about the proper treatment of contingent liabilities or the difference between inside and outside basis.\r\n\r\nLike many other tax shelter participants, they learned the promised tax savings were illusory. They paid the tax bill and the interest and penalties, but fought for a refund of the penalties.\r\n\r\nA jury of the Ervins’ western Kentucky peers found that the brothers had reasonable cause and relied in good faith on the advice of BDO and the law firm Curtis Mallet (now known as Curtis, Mallet-Prevost, Colt & Mosle LLP) when they claimed the deductions from the tax shelter, and were thus entitled to a refund of the penalties with interest.\r\n\r\nAdding salt to the IRS’s wound, the Ervins settled a lawsuit against BDO and Curtis Mallet prior to the refund trial. The IRS failed in May to convince Chief Judge Joseph H. McKinley Jr. of the U.S. District Court for the Western District of Kentucky that a refund on top of the settlement would amount to double recovery.\r\n\r\nDespite McKinley’s rejection of the government’s first argument to avoid the refund and the judge’s May 2 order to pay it, the government tried again by pointing to the lack of economic substance in Son-of-BOSS. McKinley said in an Aug. 23 ruling that the transaction’s lack of economic substance had been “conclusively established” and wasn’t the issue. The issue was the Ervin’s reliance on the advice.\r\n\r\nThe Ervins ultimately weren’t happy with their advisers and may not have had any qualms about turning over their correspondence with BDO and Curtis Mallet. The dermatologists, in contrast, seem to remain on good terms with their advisers, because those attorneys—Moore Ingram Johnson & Steele LLP—were representing them as of Sept. 1, when McKinley handed the government another loss by refusing to order the doctors—Michael J. Crowe and Artis P. Truett—to turn over emails between the doctors’ agents and attorneys at Moore Ingram.\r\n\r\nMcKinley ruled that the doctors didn’t waive their attorney-client privilege by saying in a court document that they relied on the advice of counsel in claiming deductions for their micro-captive insurance arrangements. The IRS is highly suspicious of micro-captives and has listed them in its annual “Dirty Dozen” of tax avoidance schemes.\r\n\r\nThe doctors aren’t yet close to arguing that they’re entitled to the reasonable cause exception to penalties, as McKinley pointed out. The doctors and their entities have pending Tax Court cases, and the IRS must follow Tax Court rules to get those documents—if and when the doctors lose on the substance of their deductions.\r\n\r\nCrowe and Truett won their first attorney-client privilege battle against the IRS when Judge Joseph M. Hood of the U.S. District Court for the Eastern District of Kentucky ruled, as did McKinley, that the IRS must go through the Tax Court discovery procedures.\r\n\r\nIn both of the doctors’ cases, the government relied on a U.S. Tax Court decision, AD Investments 2000 Fund v. Commissioner, which said that if the taxpayer continued to pursue a defense that it had reasonable cause to rely on the advice of its tax advisers, it would waive the attorney-client privilege protecting the documents containing that advice.\r\n\r\nAD Investments dropped the reasonable cause defense. It may have faced a more difficult battle than the Ervins. The company was a vehicle used by James Haber, the architect of Son-of-BOSS, to carry out tax shelter transactions.",
        "created_date": "2018-10-03T22:43:26.584Z",
        "is_published": true,
        "published_date": "2017-09-23T03:43:26Z"
    }
},
{
    "model": "blog.post",
    "pk": 21,
    "fields": {
        "author": [
            "abisoye"
        ],
        "title": "Sweat Equity – Coordination of Benefits Claims for School Athletes",
        "text": "The Seventh Circuit Court of Appeals joined six sister circuits in concluding that the Central States welfare plan’s attempts to force responsibility for health benefits paid to student athletes onto insurance companies that provide coverage for the youth teams do not seek equitable relief under ERISA §502(a)(3).  Central States, Se. & Sw. Areas Health & Welfare Fund v. Am. Int’l Grp., Inc., No. 15-cv-02237,  2016 BL  352884 (7th Cir. Oct. 24, 2016).  \r\n\r\nThe Central States plan is a self-funded ERISA welfare plan that provides health benefits to participating Teamsters and their beneficiaries.  The defendants are insurance companies that underwrite and administer insurance policies for school teams and youth sports leagues.  Some young athletes who were beneficiaries of the Central States plan sustained injuries while participating in the programs covered by the defendants’ policies, but received benefits from the Central States plan.  The plans contained conflicting “coordination of benefits” clauses, each placing primary responsibility on the other party.   \r\n\r\nSuch disputes are often resolved in state court, but the presence of the Central States plan raised the issue of ERISA preemption.  Thus, Central States brought the claim in federal court under ERISA §502(a)(3), seeking declaratory judgments that the insurers are primarily responsible for “current unpaid and future medical expenses” as well as already incurred and paid benefits; the imposition of an equitable lien on sums held by the insurers in the amount of benefits paid by the Central States plan; and an order requiring the insurers to reimburse the Central States plan on the basis of restitution, unjust enrichment and subrogation theories.    \r\n\r\nUnder ERISA §502(a)(3), a civil action may be brought by a fiduciary “to enjoin any act or practice which violates” ERISA or the terms of the the plan, or to obtain “other appropriate equitable relief.”  The Supreme Court has grappled with the meaning of “equitable relief” under ERISA §502(a)(3) five times in the past 25 years.  In Mertens v. Hewitt Assocs., 508 U.S. 248, 256 (1993), the Court held that “appropriate equitable relief” meant those categories of relief that were “typically available in equity, (such as injunction, mandamus, and restitution, but not compensatory damages).”\r\n\r\nIn four cases since 2002, the Court has further considered the issue of equitable relief under ERISA in the context of subrogation claims, in which a benefit plan seeks recovery of benefits it has paid from amounts the plan’s injured participant has recovered from the tortfeasor who caused the injuries.  In these cases, the Supreme Court interpreted “equitable relief” narrowly, concluding that both the cause of action and the remedy sought must be equitable, as strictly determined by reference to the days of the divided bench, before the claim could proceed under ERISA §502(a)(3).\r\n\r\nIn its recent Central States case, the Seventh Circuit divided the Supreme Court’s subrogation cases into two camps.  In all of the cases, the plaintiffs characterized their claims (for restitution or surcharge) as equitable.  The Court of Appeals noted that the difference lay in the recovery sought.  If, as in Great-West Life & Annuity Ins. Co. v. Knudson, 534 U.S. 356 (2002) and Montanile v. Bd. of Trs. of Nat’l Elevator Indus. Health Benefit Plan, 136 S. Ct. 651 (2016), the proceeds obtained from the tortfeasor were not in the hands of the defendant, the recovery was essentially in the nature of damages, and the claims did not seek equitable relief within the meaning of ERISA §502(a)(3). \r\n\r\nIn contrast, in Sereboff v. Mid-Atlantic Med. Servs., Inc., 547 U.S. 356 (2006) and US Airways, Inc. v. McCutchen, 133 S. Ct. 1537 (2013), the disputed assets remained in the plan participant’s hands, and thus could be reached through the equitable remedy of an equitable lien (imposed, for example, through the plan’s subrogation provisions). Based on this distinction, the Seventh Circuit held that the Central States plan could not recover from the defendant insurers under ERISA §502(a)(3).  The plaintiff was not seeking to enforce an equitable lien upon any specified funds: there were no specified funds in the insurers’ hands – any benefits paid by Central States were paid to the covered athletes, not the defendants.  The plaintiff’s requests for declaratory relief essentially sought reimbursement of the amounts the plan had paid.  Such claims seek damages, classic legal relief not available under ERISA §502(a)(3).  In so holding, the Seventh Circuit Court of Appeals joined six other circuits who had rejected the same arguments from the Central States plan in substantially similar actions.  \r\n\r\nSome question had lingered whether the Supreme Court’s strict interpretation of “equitable relief” would apply beyond the subrogation context.  In the Central States cases, seven circuits have now answered that question unanimously in the affirmative.  A plaintiff proceeding under ERISA §502(a)(3) faces a substantial burden to recovering monetary relief.",
        "created_date": "2018-10-03T22:45:21.832Z",
        "is_published": true,
        "published_date": "2017-11-04T22:45:21Z"
    }
},
{
    "model": "blog.post",
    "pk": 22,
    "fields": {
        "author": [
            "abisoye"
        ],
        "title": "Reverse Like-Kind Exchanges - Form Over Substance?",
        "text": "The Tax Court recently held in a division opinion that the form of the taxpayer’s transaction was determinative instead of the substance of the transaction. The court held in Bartell et al. v. Commissioner, 147 T.C. No. 5 (Aug. 10, 2016) that a taxpayer’s reverse like-kind exchange was a qualified §1031 transaction where the taxpayer carefully structured the exchange using a qualified intermediary (third-party) to hold property titles while the taxpayer retained the benefits and burdens of ownership.\r\n\r\nReverse Exchanges\r\n\r\nIn a reverse like-kind exchange, also known as a “Starker Exchange” (named after Starker v. Commissioner, 602 F.2d 1341 (9th Cir. 1979)), a taxpayer receives the replacement property before disposing of the relinquished property. There has been no question that forward exchanges were contemplated by §1031. However, in Starker, courts expanded the scope and allowed deferred exchanges (now codified in §1031(a)(3)) and the IRS promulgated regulations to allow deferred forward exchanges. Following litigation the IRS released guidance in a safe harbor allowing for “parking arrangements” aka reverse exchanges, where a taxpayer uses a third-party to “park” title and ownership of the replacement property while deferring disposition of the relinquished property. Rev. Proc. 2000-37, 2000-2 C.B. 308. Bartell took place before the safe harbor was released, making it an interesting fact pattern because it allows reverse exchanges outside of the safe harbor.\r\n\r\nTaxpayer’s Reverse Exchange Structure\r\n\r\nThe taxpayer is a drug store chain which identified a potential retail location to open another store. At the time the taxpayer was not clear on which property it would relinquish in the §1031 exchange. To facilitate a qualified §1031 exchange and acquire parcel L before relinquishment of parcel E, the taxpayer engaged with a qualified third-party intermediary (QI). QI formed an LLC special purpose entity (SPE) that would take title and “own” L while in substance giving the taxpayer full use, benefits, and burdens of the property via contractual arrangements and lease-back. Taxpayer provided insurance and indemnity to SPE on L. During construction of L, taxpayer found a suitable buyer for E. Taxpayer engaged in a purchase and sale agreement for E, assigning its rights and proceeds to QI. QI in turn applied the proceeds to an exchange with SPE, receiving L in return and completing the transaction by deeding L to taxpayer in a pre-arranged contract. Taxpayer deferred the proceeds from E on its return and the IRS disallowed the purported §1031 treatment.\r\n\r\nTaxpayer’s Form Over Substance\r\n\r\nThe Tax Court distinguished the facts in Decleene v. Commissioner, 115 T.C. 457 (2000), stating that the taxpayer in Bartell did not engage in a self-exchange unlike the transaction in Decleene. In Decleene, the taxpayer had obtained the replacement property a year before engaging in a like-kind exchange and transferred title directly to the purchaser of the relinquished property. The court explained that the facts in that case weighed heavily against the taxpayer as it appeared a §1031 exchange was contemplated after acquiring the replacement property instead of carefully using a third-party intermediary to engage in a deliberate §1031 exchange. In contrast, the taxpayer in Bartell went to great lengths to properly structure the transaction and use a QI to hold title and contractual arrangements to be afforded use of the land in the meantime. These factors led the Tax Court to hold for the taxpayer.\r\n\r\nThe court noted that taxpayers are traditionally given widelatitude to structure their transactions to comply with §1031. The IRS and the taxpayer disagreed whether the legal standard of ownership in a like-kind exchange is a pure “title” standard or the benefits and burdens test that is generally used to determine ownership in tax law. Under the benefits and burdens standard, the taxpayer “owned” the property because it directed its use, overseeing construction, obtaining permits, paying insurance, and otherwise enjoying full use of L.\r\n\r\nThe Tax Court held that the legal standard is more form than substance. The 9th Circuit (taxpayer would appeal to this circuit) had expressly rejected the benefits and burdens test in the §1031 context. Alderson v. Commissioner, 317 F.2d 790 (9th Cir. 1963). Under the Golsen rule the court is obligated to follow the precedent of the circuit which this case would be appealable to. Additionally, the court noted that its own precedent afforded taxpayers discretion in the form of their affairs in these kinds of transactions.\r\n\r\nFinal Thoughts\r\n\r\nAlso of note is the timeframe of the reverse exchange. The taxpayer identified the replacement property and SPE took title to it 17 months before the taxpayer disposed of the relinquished property. This is well outside of the time frame afforded under the safe harbor. While the Tax Court specifically held the reverse exchange was qualified within the time period in this case, the favorable outcome to taxpayers in Bartell should give some comfort to practitioners who may be outside of the safe harbor. Carefully structuring and purposefully intending a §1031 exchange seems to have carried the day in Bartell. How the IRS views this decision, heavily dependent on its facts, is to be determined. The rarity of taxpayer’s form over substance carrying the day is something to closely follow...",
        "created_date": "2018-10-03T22:46:35.447Z",
        "is_published": true,
        "published_date": "2016-09-25T22:46:35Z"
    }
},
{
    "model": "blog.post",
    "pk": 23,
    "fields": {
        "author": [
            "abisoye"
        ],
        "title": "Is Tax Preparation Software Safe To Use?",
        "text": "Tax season is one of the most popular times for people to become victims of scams. According to the IRS, tax refund fraud is expected to soar this tax season, reaching $21 billion this year compared to just $6.5 billion two years ago.\r\n\r\nAnother cause for angst this tax season is the potential theft of your personal and financial information from online tax return preparation vendors. Recently, TaxAct reported that approximately 450 customers may have had personal and tax return information stolen, leading the vendor to freeze more than 9,000 customer accounts,1 and TaxSlayer reported 8,800 of its customers' personal information may have been compromised.2\r\n\r\nOnline DIY tax software packages contain a treasure trove of private personal and financial information--full names, dates of birth, social security numbers, and bank account information.\r\n\r\nTaxSlayer and TaxAct say they don’t believe their systems were breached. They believe a third party used username and password combinations obtained from outside sources to illegally access their customers’ accounts.\r\n\r\nWhile there is nothing you can do to prevent the online tax preparation vendor’s vulnerability to security breaches, there are steps that you can take to minimize the risk of having your information stolen. These steps include filing your tax return as early as possible, monitoring your credit frequently, using a different password for each account and each website that you visit, using strong passwords, changing your passwords frequently, and making sure that your computer is running reputable, up-to-date antivirus software.\r\n\r\nOn a related note, beware of scam phone calls in which callers pretend to be from the IRS, then either trick you into sending them money by demanding immediate payment of back taxes, or trick you into sharing private information by claiming that you’re owed a refund. The IRS website provides tips for identifying this kind of scam phone calls: https://www.irs.gov/uac/Newsroom/Scam-Phone-Calls-Continue%3B-IRS-Identifies-Five-Easy-Ways-to-Spot-Suspicious-Calls.",
        "created_date": "2018-10-03T22:57:26.865Z",
        "is_published": true,
        "published_date": "2018-10-03T22:57:26.866Z"
    }
},
{
    "model": "admin.logentry",
    "pk": 1,
    "fields": {
        "action_time": "2018-09-12T23:11:08.189Z",
        "user": [
            "admin"
        ],
        "content_type": [
            "blog",
            "post"
        ],
        "object_id": "1",
        "object_repr": "Lebron James is Whack",
        "action_flag": 1,
        "change_message": "[{\"added\": {}}]"
    }
},
{
    "model": "admin.logentry",
    "pk": 2,
    "fields": {
        "action_time": "2018-09-12T23:12:25.037Z",
        "user": [
            "admin"
        ],
        "content_type": [
            "blog",
            "post"
        ],
        "object_id": "2",
        "object_repr": "Russell Westbrook Cannot Shoot",
        "action_flag": 1,
        "change_message": "[{\"added\": {}}]"
    }
},
{
    "model": "admin.logentry",
    "pk": 3,
    "fields": {
        "action_time": "2018-09-12T23:17:42.337Z",
        "user": [
            "admin"
        ],
        "content_type": [
            "blog",
            "post"
        ],
        "object_id": "1",
        "object_repr": "Lebron James is Whack",
        "action_flag": 2,
        "change_message": "[{\"changed\": {\"fields\": [\"created_date\"]}}]"
    }
},
{
    "model": "admin.logentry",
    "pk": 4,
    "fields": {
        "action_time": "2018-09-12T23:18:05.645Z",
        "user": [
            "admin"
        ],
        "content_type": [
            "blog",
            "post"
        ],
        "object_id": "2",
        "object_repr": "Russell Westbrook Cannot Shoot",
        "action_flag": 2,
        "change_message": "[{\"changed\": {\"fields\": [\"created_date\"]}}]"
    }
},
{
    "model": "admin.logentry",
    "pk": 5,
    "fields": {
        "action_time": "2018-09-12T23:19:07.899Z",
        "user": [
            "admin"
        ],
        "content_type": [
            "blog",
            "post"
        ],
        "object_id": "3",
        "object_repr": "Gilbert Arenas Needs to Shut Up",
        "action_flag": 1,
        "change_message": "[{\"added\": {}}]"
    }
},
{
    "model": "admin.logentry",
    "pk": 6,
    "fields": {
        "action_time": "2018-09-12T23:20:00.736Z",
        "user": [
            "admin"
        ],
        "content_type": [
            "blog",
            "post"
        ],
        "object_id": "1",
        "object_repr": "Lebron James is Whack",
        "action_flag": 2,
        "change_message": "[{\"changed\": {\"fields\": [\"published_date\"]}}]"
    }
},
{
    "model": "admin.logentry",
    "pk": 7,
    "fields": {
        "action_time": "2018-09-12T23:20:46.888Z",
        "user": [
            "admin"
        ],
        "content_type": [
            "blog",
            "post"
        ],
        "object_id": "4",
        "object_repr": "ESPN Ratings plumetting",
        "action_flag": 1,
        "change_message": "[{\"added\": {}}]"
    }
},
{
    "model": "admin.logentry",
    "pk": 8,
    "fields": {
        "action_time": "2018-09-12T23:31:57.811Z",
        "user": [
            "admin"
        ],
        "content_type": [
            "blog",
            "post"
        ],
        "object_id": "4",
        "object_repr": "ESPN Ratings Plumetting",
        "action_flag": 2,
        "change_message": "[{\"changed\": {\"fields\": [\"title\"]}}]"
    }
},
{
    "model": "admin.logentry",
    "pk": 9,
    "fields": {
        "action_time": "2018-10-03T00:31:33.265Z",
        "user": [
            "admin"
        ],
        "content_type": [
            "auth",
            "user"
        ],
        "object_id": "3",
        "object_repr": "abisoye",
        "action_flag": 1,
        "change_message": "[{\"added\": {}}]"
    }
},
{
    "model": "admin.logentry",
    "pk": 10,
    "fields": {
        "action_time": "2018-10-03T00:35:10.121Z",
        "user": [
            "admin"
        ],
        "content_type": [
            "auth",
            "user"
        ],
        "object_id": "3",
        "object_repr": "abisoye",
        "action_flag": 2,
        "change_message": "[{\"changed\": {\"fields\": [\"first_name\", \"last_name\", \"email\"]}}]"
    }
},
{
    "model": "admin.logentry",
    "pk": 11,
    "fields": {
        "action_time": "2018-10-03T00:35:24.668Z",
        "user": [
            "admin"
        ],
        "content_type": [
            "auth",
            "user"
        ],
        "object_id": "3",
        "object_repr": "abisoye",
        "action_flag": 2,
        "change_message": "[{\"changed\": {\"fields\": [\"is_staff\"]}}]"
    }
},
{
    "model": "admin.logentry",
    "pk": 12,
    "fields": {
        "action_time": "2018-10-04T03:24:19.533Z",
        "user": [
            "admin"
        ],
        "content_type": [
            "blog",
            "post"
        ],
        "object_id": "14",
        "object_repr": "This better work!",
        "action_flag": 3,
        "change_message": ""
    }
},
{
    "model": "admin.logentry",
    "pk": 13,
    "fields": {
        "action_time": "2018-10-04T03:24:19.541Z",
        "user": [
            "admin"
        ],
        "content_type": [
            "blog",
            "post"
        ],
        "object_id": "11",
        "object_repr": "Conor McGregor Will Get Knocked Out!!",
        "action_flag": 3,
        "change_message": ""
    }
},
{
    "model": "admin.logentry",
    "pk": 14,
    "fields": {
        "action_time": "2018-10-04T03:24:19.547Z",
        "user": [
            "admin"
        ],
        "content_type": [
            "blog",
            "post"
        ],
        "object_id": "9",
        "object_repr": "Tiger Woods Yall!",
        "action_flag": 3,
        "change_message": ""
    }
},
{
    "model": "admin.logentry",
    "pk": 15,
    "fields": {
        "action_time": "2018-10-04T03:24:19.555Z",
        "user": [
            "admin"
        ],
        "content_type": [
            "blog",
            "post"
        ],
        "object_id": "7",
        "object_repr": "Testing after successful save",
        "action_flag": 3,
        "change_message": ""
    }
},
{
    "model": "admin.logentry",
    "pk": 16,
    "fields": {
        "action_time": "2018-10-04T03:24:19.562Z",
        "user": [
            "admin"
        ],
        "content_type": [
            "blog",
            "post"
        ],
        "object_id": "5",
        "object_repr": "I Hate College Football",
        "action_flag": 3,
        "change_message": ""
    }
},
{
    "model": "admin.logentry",
    "pk": 17,
    "fields": {
        "action_time": "2018-10-04T03:24:19.569Z",
        "user": [
            "admin"
        ],
        "content_type": [
            "blog",
            "post"
        ],
        "object_id": "4",
        "object_repr": "ESPN Ratings Plumetting",
        "action_flag": 3,
        "change_message": ""
    }
},
{
    "model": "admin.logentry",
    "pk": 18,
    "fields": {
        "action_time": "2018-10-04T03:24:19.576Z",
        "user": [
            "admin"
        ],
        "content_type": [
            "blog",
            "post"
        ],
        "object_id": "2",
        "object_repr": "Russell Westbrook Cannot Shoot",
        "action_flag": 3,
        "change_message": ""
    }
}
]
